FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M7_SAMV71_Xplained_IAR_Keil/libchip_samv7/include/samv7/component/component_hsmci.h
#define HSMCI_IER_ACKRCV                 ( 0x1u << 28 ) /**< \brief (HSMCI_IER) Boot Acknowledge Interrupt Enable */
#define HSMCI_IER_ACKRCVE                ( 0x1u << 29 ) /**< \brief (HSMCI_IER) Boot Acknowledge Error Interrupt Enable */
#define HSMCI_IER_OVRE                   ( 0x1u << 30 ) /**< \brief (HSMCI_IER) Overrun Interrupt Enable */
#define HSMCI_IER_UNRE                   ( 0x1u << 31 ) /**< \brief (HSMCI_IER) Underrun Interrupt Enable */
/* -------- HSMCI_IDR : (HSMCI Offset: 0x48) Interrupt Disable Register -------- */
#define HSMCI_IDR_CMDRDY                 ( 0x1u << 0 )  /**< \brief (HSMCI_IDR) Command Ready Interrupt Disable */
#define HSMCI_IDR_RXRDY                  ( 0x1u << 1 )  /**< \brief (HSMCI_IDR) Receiver Ready Interrupt Disable */
#define HSMCI_IDR_TXRDY                  ( 0x1u << 2 )  /**< \brief (HSMCI_IDR) Transmit Ready Interrupt Disable */
#define HSMCI_IDR_BLKE                   ( 0x1u << 3 )  /**< \brief (HSMCI_IDR) Data Block Ended Interrupt Disable */
#define HSMCI_IDR_DTIP                   ( 0x1u << 4 )  /**< \brief (HSMCI_IDR) Data Transfer in Progress Interrupt Disable */
#define HSMCI_IDR_NOTBUSY                ( 0x1u << 5 )  /**< \brief (HSMCI_IDR) Data Not Busy Interrupt Disable */
#define HSMCI_IDR_SDIOIRQA               ( 0x1u << 8 )  /**< \brief (HSMCI_IDR) SDIO Interrupt for Slot A Interrupt Disable */
#define HSMCI_IDR_SDIOWAIT               ( 0x1u << 12 ) /**< \brief (HSMCI_IDR) SDIO Read Wait Operation Status Interrupt Disable */
#define HSMCI_IDR_CSRCV                  ( 0x1u << 13 ) /**< \brief (HSMCI_IDR) Completion Signal received interrupt Disable */
#define HSMCI_IDR_RINDE                  ( 0x1u << 16 ) /**< \brief (HSMCI_IDR) Response Index Error Interrupt Disable */
#define HSMCI_IDR_RDIRE                  ( 0x1u << 17 ) /**< \brief (HSMCI_IDR) Response Direction Error Interrupt Disable */
#define HSMCI_IDR_RCRCE                  ( 0x1u << 18 ) /**< \brief (HSMCI_IDR) Response CRC Error Interrupt Disable */
#define HSMCI_IDR_RENDE                  ( 0x1u << 19 ) /**< \brief (HSMCI_IDR) Response End Bit Error Interrupt Disable */
#define HSMCI_IDR_RTOE                   ( 0x1u << 20 ) /**< \brief (HSMCI_IDR) Response Time-out Error Interrupt Disable */
#define HSMCI_IDR_DCRCE                  ( 0x1u << 21 ) /**< \brief (HSMCI_IDR) Data CRC Error Interrupt Disable */
#define HSMCI_IDR_DTOE                   ( 0x1u << 22 ) /**< \brief (HSMCI_IDR) Data Time-out Error Interrupt Disable */
#define HSMCI_IDR_CSTOE                  ( 0x1u << 23 ) /**< \brief (HSMCI_IDR) Completion Signal Time out Error Interrupt Disable */
#define HSMCI_IDR_BLKOVRE                ( 0x1u << 24 ) /**< \brief (HSMCI_IDR) DMA Block Overrun Error Interrupt Disable */
#define HSMCI_IDR_FIFOEMPTY              ( 0x1u << 26 ) /**< \brief (HSMCI_IDR) FIFO empty Interrupt Disable */
#define HSMCI_IDR_XFRDONE                ( 0x1u << 27 ) /**< \brief (HSMCI_IDR) Transfer Done Interrupt Disable */
#define HSMCI_IDR_ACKRCV                 ( 0x1u << 28 ) /**< \brief (HSMCI_IDR) Boot Acknowledge Interrupt Disable */
#define HSMCI_IDR_ACKRCVE                ( 0x1u << 29 ) /**< \brief (HSMCI_IDR) Boot Acknowledge Error Interrupt Disable */
#define HSMCI_IDR_OVRE                   ( 0x1u << 30 ) /**< \brief (HSMCI_IDR) Overrun Interrupt Disable */
#define HSMCI_IDR_UNRE                   ( 0x1u << 31 ) /**< \brief (HSMCI_IDR) Underrun Interrupt Disable */
/* -------- HSMCI_IMR : (HSMCI Offset: 0x4C) Interrupt Mask Register -------- */
#define HSMCI_IMR_CMDRDY                 ( 0x1u << 0 )  /**< \brief (HSMCI_IMR) Command Ready Interrupt Mask */
#define HSMCI_IMR_RXRDY                  ( 0x1u << 1 )  /**< \brief (HSMCI_IMR) Receiver Ready Interrupt Mask */
#define HSMCI_IMR_TXRDY                  ( 0x1u << 2 )  /**< \brief (HSMCI_IMR) Transmit Ready Interrupt Mask */
#define HSMCI_IMR_BLKE                   ( 0x1u << 3 )  /**< \brief (HSMCI_IMR) Data Block Ended Interrupt Mask */
#define HSMCI_IMR_DTIP                   ( 0x1u << 4 )  /**< \brief (HSMCI_IMR) Data Transfer in Progress Interrupt Mask */
#define HSMCI_IMR_NOTBUSY                ( 0x1u << 5 )  /**< \brief (HSMCI_IMR) Data Not Busy Interrupt Mask */
#define HSMCI_IMR_SDIOIRQA               ( 0x1u << 8 )  /**< \brief (HSMCI_IMR) SDIO Interrupt for Slot A Interrupt Mask */
#define HSMCI_IMR_SDIOWAIT               ( 0x1u << 12 ) /**< \brief (HSMCI_IMR) SDIO Read Wait Operation Status Interrupt Mask */
#define HSMCI_IMR_CSRCV                  ( 0x1u << 13 ) /**< \brief (HSMCI_IMR) Completion Signal Received Interrupt Mask */
#define HSMCI_IMR_RINDE                  ( 0x1u << 16 ) /**< \brief (HSMCI_IMR) Response Index Error Interrupt Mask */
#define HSMCI_IMR_RDIRE                  ( 0x1u << 17 ) /**< \brief (HSMCI_IMR) Response Direction Error Interrupt Mask */
#define HSMCI_IMR_RCRCE                  ( 0x1u << 18 ) /**< \brief (HSMCI_IMR) Response CRC Error Interrupt Mask */
#define HSMCI_IMR_RENDE                  ( 0x1u << 19 ) /**< \brief (HSMCI_IMR) Response End Bit Error Interrupt Mask */
#define HSMCI_IMR_RTOE                   ( 0x1u << 20 ) /**< \brief (HSMCI_IMR) Response Time-out Error Interrupt Mask */
#define HSMCI_IMR_DCRCE                  ( 0x1u << 21 ) /**< \brief (HSMCI_IMR) Data CRC Error Interrupt Mask */
#define HSMCI_IMR_DTOE                   ( 0x1u << 22 ) /**< \brief (HSMCI_IMR) Data Time-out Error Interrupt Mask */
#define HSMCI_IMR_CSTOE                  ( 0x1u << 23 ) /**< \brief (HSMCI_IMR) Completion Signal Time-out Error Interrupt Mask */
#define HSMCI_IMR_BLKOVRE                ( 0x1u << 24 ) /**< \brief (HSMCI_IMR) DMA Block Overrun Error Interrupt Mask */
#define HSMCI_IMR_FIFOEMPTY              ( 0x1u << 26 ) /**< \brief (HSMCI_IMR) FIFO Empty Interrupt Mask */
#define HSMCI_IMR_XFRDONE                ( 0x1u << 27 ) /**< \brief (HSMCI_IMR) Transfer Done Interrupt Mask */
#define HSMCI_IMR_ACKRCV                 ( 0x1u << 28 ) /**< \brief (HSMCI_IMR) Boot Operation Acknowledge Received Interrupt Mask */
#define HSMCI_IMR_ACKRCVE                ( 0x1u << 29 ) /**< \brief (HSMCI_IMR) Boot Operation Acknowledge Error Interrupt Mask */
#define HSMCI_IMR_OVRE                   ( 0x1u << 30 ) /**< \brief (HSMCI_IMR) Overrun Interrupt Mask */
#define HSMCI_IMR_UNRE                   ( 0x1u << 31 ) /**< \brief (HSMCI_IMR) Underrun Interrupt Mask */
/* -------- HSMCI_DMA : (HSMCI Offset: 0x50) DMA Configuration Register -------- */
#define HSMCI_DMA_CHKSIZE_Pos            4
#define HSMCI_DMA_CHKSIZE_Msk            ( 0x7u << HSMCI_DMA_CHKSIZE_Pos )     /**< \brief (HSMCI_DMA) DMA Channel Read and Write Chunk Size */
#define   HSMCI_DMA_CHKSIZE_1            ( 0x0u << 4 )                         /**< \brief (HSMCI_DMA) 1 data available */
#define   HSMCI_DMA_CHKSIZE_2            ( 0x1u << 4 )                         /**< \brief (HSMCI_DMA) 2 data available */
#define   HSMCI_DMA_CHKSIZE_4            ( 0x2u << 4 )                         /**< \brief (HSMCI_DMA) 4 data available */
#define   HSMCI_DMA_CHKSIZE_8            ( 0x3u << 4 )                         /**< \brief (HSMCI_DMA) 8 data available */
#define   HSMCI_DMA_CHKSIZE_16           ( 0x4u << 4 )                         /**< \brief (HSMCI_DMA) 16 data available */
#define HSMCI_DMA_DMAEN                  ( 0x1u << 8 )                         /**< \brief (HSMCI_DMA) DMA Hardware Handshaking Enable */
/* -------- HSMCI_CFG : (HSMCI Offset: 0x54) Configuration Register -------- */
#define HSMCI_CFG_FIFOMODE               ( 0x1u << 0 )                         /**< \brief (HSMCI_CFG) HSMCI Internal FIFO control mode */
#define HSMCI_CFG_FERRCTRL               ( 0x1u << 4 )                         /**< \brief (HSMCI_CFG) Flow Error flag reset control mode */
#define HSMCI_CFG_HSMODE                 ( 0x1u << 8 )                         /**< \brief (HSMCI_CFG) High Speed Mode */
#define HSMCI_CFG_LSYNC                  ( 0x1u << 12 )                        /**< \brief (HSMCI_CFG) Synchronize on the last block */
/* -------- HSMCI_WPMR : (HSMCI Offset: 0xE4) Write Protection Mode Register -------- */
#define HSMCI_WPMR_WPEN                  ( 0x1u << 0 )                         /**< \brief (HSMCI_WPMR) Write Protect Enable */
#define HSMCI_WPMR_WPKEY_Pos             8
#define HSMCI_WPMR_WPKEY_Msk             ( 0xffffffu << HSMCI_WPMR_WPKEY_Pos ) /**< \brief (HSMCI_WPMR) Write Protect Key */
#define   HSMCI_WPMR_WPKEY_PASSWD        ( 0x4D4349u << 8 )                    /**< \brief (HSMCI_WPMR) Writing any other value in this field aborts the write operation of the WPEN bit.Always reads as 0. */
/* -------- HSMCI_WPSR : (HSMCI Offset: 0xE8) Write Protection Status Register -------- */
#define HSMCI_WPSR_WPVS                  ( 0x1u << 0 )                         /**< \brief (HSMCI_WPSR) Write Protection Violation Status */
#define HSMCI_WPSR_WPVSRC_Pos            8
#define HSMCI_WPSR_WPVSRC_Msk            ( 0xffffu << HSMCI_WPSR_WPVSRC_Pos )  /**< \brief (HSMCI_WPSR) Write Protection Violation Source */
/* -------- HSMCI_VERSION : (HSMCI Offset: 0xFC) Version Register -------- */
#define HSMCI_VERSION_VERSION_Pos        0
#define HSMCI_VERSION_VERSION_Msk        ( 0xfffu << HSMCI_VERSION_VERSION_Pos ) /**< \brief (HSMCI_VERSION) Hardware Module Version */
#define HSMCI_VERSION_MFN_Pos            16
#define HSMCI_VERSION_MFN_Msk            ( 0x7u << HSMCI_VERSION_MFN_Pos )       /**< \brief (HSMCI_VERSION) Metal Fix Number */

/*@}*/


#endif /* _SAM_HSMCI_COMPONENT_ */
